multiscaleModeling/project/00mainFracture/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1e-3;


vertices
(
(-0.2338501553 -0.1 -1)
(51.52995887 -0.1 -1)
(51.5835487 0.1 -1)
(-0.1802603168 0.1 -1)
(-0.2338501553 -0.1 1)
(51.52995887 -0.1 1)
(51.5835487 0.1 1)
(-0.1802603168 0.1 1)
(1.748973869 7.3 -1)
(53.51278289 7.3 -1)
(53.61996257 7.7 -1)
(1.856153546 7.7 -1)
(1.748973869 7.3 1)
(53.51278289 7.3 1)
(53.61996257 7.7 1)
(1.856153546 7.7 1)
(3.785387731 14.9 -1)
(55.54919675 14.9 -1)
(55.60278659 15.1 -1)
(3.83897757 15.1 -1)
(3.785387731 14.9 1)
(55.54919675 14.9 1)
(55.60278659 15.1 1)
(3.83897757 15.1 1)
(-0.1802603168 0.1 -1)
(0.2338501553 0.1 -1)
(2.163084341 7.3 -1)
(1.748973869 7.3 -1)
(-0.1802603168 0.1 1)
(0.2338501553 0.1 1)
(2.163084341 7.3 1)
(1.748973869 7.3 1)
(1.856153546 7.7 -1)
(2.270264018 7.7 -1)
(4.199498203 14.9 -1)
(3.785387731 14.9 -1)
(1.856153546 7.7 1)
(2.270264018 7.7 1)
(4.199498203 14.9 1)
(3.785387731 14.9 1)
(9.965446251 0.1 -1)
(10.17250149 0.1 -1)
(12.10173567 7.3 -1)
(11.89468044 7.3 -1)
(9.965446251 0.1 1)
(10.17250149 0.1 1)
(12.10173567 7.3 1)
(11.89468044 7.3 1)
(12.00186011 7.7 -1)
(12.20891535 7.7 -1)
(14.13814954 14.9 -1)
(13.9310943 14.9 -1)
(12.00186011 7.7 1)
(12.20891535 7.7 1)
(14.13814954 14.9 1)
(13.9310943 14.9 1)
(30.46391462 0.1 -1)
(30.8780251 0.1 -1)
(32.80725928 7.3 -1)
(32.39314881 7.3 -1)
(30.46391462 0.1 1)
(30.8780251 0.1 1)
(32.80725928 7.3 1)
(32.39314881 7.3 1)
(32.50032849 7.7 -1)
(32.91443896 7.7 -1)
(34.84367314 14.9 -1)
(34.42956267 14.9 -1)
(32.50032849 7.7 1)
(32.91443896 7.7 1)
(34.84367314 14.9 1)
(34.42956267 14.9 1)
(41.02373166 0.1 -1)
(41.2307869 0.1 -1)
(43.16002109 7.3 -1)
(42.95296585 7.3 -1)
(41.02373166 0.1 1)
(41.2307869 0.1 1)
(43.16002109 7.3 1)
(42.95296585 7.3 1)
(43.06014553 7.7 -1)
(43.26720076 7.7 -1)
(45.19643495 14.9 -1)
(44.98937971 14.9 -1)
(43.06014553 7.7 1)
(43.26720076 7.7 1)
(45.19643495 14.9 1)
(44.98937971 14.9 1)
(51.37649347 0.1 -1)
(51.5835487 0.1 -1)
(53.51278289 7.3 -1)
(53.30572765 7.3 -1)
(51.37649347 0.1 1)
(51.5835487 0.1 1)
(53.51278289 7.3 1)
(53.30572765 7.3 1)
(53.41290733 7.7 -1)
(53.61996257 7.7 -1)
(55.54919675 14.9 -1)
(55.34214152 14.9 -1)
(53.41290733 7.7 1)
(53.61996257 7.7 1)
(55.54919675 14.9 1)
(55.34214152 14.9 1)
);

blocks
(
hex (0 1 2 3 4 5 6 7) (500 10 1) simpleGrading (1 1 1)
hex (8 9 10 11 12 13 14 15) (500 10 1) simpleGrading (1 1 1)
hex (16 17 18 19 20 21 22 23) (500 10 1) simpleGrading (1 1 1)
hex (24 25 26 27 28 29 30 31) (10 100 1) simpleGrading (1 1 1)
hex (32 33 34 35 36 37 38 39) (10 100 1) simpleGrading (1 1 1)
hex (40 41 42 43 44 45 46 47) (10 100 1) simpleGrading (1 1 1)
hex (48 49 50 51 52 53 54 55) (10 100 1) simpleGrading (1 1 1)
hex (56 57 58 59 60 61 62 63) (10 100 1) simpleGrading (1 1 1)
hex (64 65 66 67 68 69 70 71) (10 100 1) simpleGrading (1 1 1)
hex (72 73 74 75 76 77 78 79) (10 100 1) simpleGrading (1 1 1)
hex (80 81 82 83 84 85 86 87) (10 100 1) simpleGrading (1 1 1)
hex (88 89 90 91 92 93 94 95) (10 100 1) simpleGrading (1 1 1)
hex (96 97 98 99 100 101 102 103) (10 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
leakyWallA
{
type wall;
faces
(
(3 7 6 2)
);
}

leakyWallB
{
type wall;
faces
(
(9 13 12 8)
);
}

leakyWallC
{
type wall;
faces
(
(11 15 14 10)
);
}

leakyWallD
{
type wall;
faces
(
(17 21 20 16)
);
}

deadWall
{
type wall;
faces
(
(1 5 4 0)
(0 4 7 3)
(2 6 5 1)
(16 20 23 19)
(19 23 22 18)
(18 22 21 17)
(24 28 31 27)
(26 30 29 25)
(32 36 39 35)
(34 38 37 33)
(40 44 47 43)
(42 46 45 41)
(48 52 55 51)
(50 54 53 49)
(56 60 63 59)
(58 62 61 57)
(64 68 71 67)
(66 70 69 65)
(72 76 79 75)
(74 78 77 73)
(80 84 87 83)
(82 86 85 81)
(88 92 95 91)
(90 94 93 89)
(96 100 103 99)
(98 102 101 97)
);
}

interfaceA
{
type patch;
faces
(
(25 29 28 24)
(41 45 44 40)
(57 61 60 56)
(73 77 76 72)
(89 93 92 88)
);
}

interfaceB
{
type patch;
faces
(
(27 31 30 26)
(43 47 46 42)
(59 63 62 58)
(75 79 78 74)
(91 95 94 90)
);
}

interfaceC
{
type patch;
faces
(
(33 37 36 32)
(49 53 52 48)
(65 69 68 64)
(81 85 84 80)
(97 101 100 96)
);
}

interfaceD
{
type patch;
faces
(
(35 39 38 34)
(51 55 54 50)
(67 71 70 66)
(83 87 86 82)
(99 103 102 98)
);
}

inlet
{
type patch;
faces
(
(8 12 15 11)
);
}

outlet
{
type patch;
faces
(
(10 14 13 9)
);
}

frontAndBack
{
type empty;
faces
(
(0 3 2 1)
(4 5 6 7)
(8 11 10 9)
(12 13 14 15)
(16 19 18 17)
(20 21 22 23)
(24 27 26 25)
(28 29 30 31)
(32 35 34 33)
(36 37 38 39)
(40 43 42 41)
(44 45 46 47)
(48 51 50 49)
(52 53 54 55)
(56 59 58 57)
(60 61 62 63)
(64 67 66 65)
(68 69 70 71)
(72 75 74 73)
(76 77 78 79)
(80 83 82 81)
(84 85 86 87)
(88 91 90 89)
(92 93 94 95)
(96 99 98 97)
(100 101 102 103)
);
}

);

mergePatchPairs
(
(leakyWallA interfaceA)
(leakyWallB interfaceB)
(leakyWallC interfaceC)
(leakyWallD interfaceD)
);
