multiscaleModeling/project/00mainFracture/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1712                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0.5";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
25000
(
(-1.00263e-08 1.12932e-09 9.82217e-36)
(1.55056e-08 -1.86078e-09 -1.23622e-33)
(5.83784e-08 -1.1234e-09 -2.38148e-33)
(2.0603e-07 -8.80277e-09 -1.12542e-32)
(3.42151e-07 -1.44814e-09 -2.32773e-32)
(3.57004e-07 -1.0731e-09 3.05827e-33)
(3.66594e-07 1.49034e-10 1.38253e-33)
(3.64074e-07 -9.76765e-11 -4.50637e-32)
...
)
;

boundaryField
{
    leakyWallA
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    leakyWallB
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    leakyWallC
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    leakyWallD
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    deadWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
