multiscaleModeling/project/00mainFracture/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1712                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0.5";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
25000
(
1.96128e-05
1.9618e-05
1.96136e-05
1.96155e-05
1.95746e-05
1.95393e-05
1.95e-05
1.94629e-05
...
)
;

boundaryField
{
    leakyWallA
    {
        type            zeroGradient;
    }
    leakyWallB
    {
        type            zeroGradient;
    }
    leakyWallC
    {
        type            zeroGradient;
    }
    leakyWallD
    {
        type            zeroGradient;
    }
    deadWall
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 2e-05;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
