multiscaleModeling/project/00mainFracture/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }

    outlet
    {
       // type            fixedValue;
       // value           uniform 0; 
        type            zeroGradient;
    }


    leakyWallA
    {
        type            zeroGradient;
    }

    leakyWallB
    {
        type            zeroGradient;
    }
    
    leakyWallC
    {
        type            zeroGradient;
    }
    
    leakyWallD
    {
        type            zeroGradient;
    }    
        
    deadWall
    {
        type            zeroGradient;
    }


    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
